In [1]:
import pandas as pd

# 중복 데이터 드롭하기
중복된 데이터 드롭하는 방법에 대해 알아보겠습니다.

In [3]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

## 중복된 데이터 확인 하기

In [5]:
df.duplicated()  #  true는 중복된 값

0    False
1    False
2    False
3    False
4     True
dtype: bool

drop_duplicates 함수로 중복 데이터를 삭제하는 예제입니다.

In [6]:
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

## 열에 있는 중복값 제거하기

In [7]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John  Computer Science    male

name 컬럼이 똑같을 경우, 중복된 데이터라고 표시하라는 예제입니다.

In [8]:
df.duplicated(['name'])  # 이름에서 중복된 값을 찾아라

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

keep 값을 first 또는 last라고 값을 줘서 중복된 값 중, 어느값을 살릴 지 결정하실 수 있습니다.  
기본적으로 first로 설정되어 있습니다.

In [10]:
df.drop_duplicates(['name'], keep='last') # keep 이 first(디폴트값)이면 앞에값을 남겨라 last이면 나중값을 남겨라

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John  Computer Science    male